In [2]:
# Run this cell without changes
import sqlite3
import pandas as pd

In [ ]:
# Run this cell without changes
northwind_path = 'Northwind.sqlite'
# Open up a connection
conn = sqlite3.connect(northwind_path)
# Initialize a cursor
cursor = conn.cursor()

In [4]:
# Run this cell without changes
table_name_query = """SELECT name 
                      AS 'Table Names' 
                      FROM sqlite_master 
                      WHERE type='table';"""

pd.read_sql(table_name_query, conn)

             Table Names
0               Employee
1               Category
2               Customer
3                Shipper
4               Supplier
5                  Order
6                Product
7            OrderDetail
8   CustomerCustomerDemo
9    CustomerDemographic
10                Region
11             Territory
12     EmployeeTerritory

In [10]:
# # 'Order'
# q = """SELECT * FROM Order LIMIT 1;"""
# pd.read_sql(q, conn)

# >>> ERROR

In [ ]:
# 'Order'
q = """SELECT * FROM 'Order' LIMIT 1;"""
pd.read_sql(q, conn)

,Id,CustomerId,EmployeeId,OrderDate,RequiredDate,ShippedDate,ShipVia,Freight,ShipName,ShipAddress,ShipCity,ShipRegion,ShipPostalCode,ShipCountry
0,10248,VINET,5,2012-07-04,2012-08-01,2012-07-16,3,32.38,Vins et alcools Chevalier,59 rue de l'Abbaye,Reims,Western Europe,51100,France

In [12]:
# Shipper
q = """SELECT * FROM Shipper LIMIT 1;"""
pd.read_sql(q, conn)

   Id     CompanyName           Phone
0   1  Speedy Express  (503) 555-9831

In [ ]:
# 'Order'
q = """
SELECT * FROM 'Order'
WHERE Freight > 1000
ORDER BY Freight DESC
;"""
pd.read_sql(q, conn)

,Id,CustomerId,EmployeeId,OrderDate,RequiredDate,ShippedDate,ShipVia,Freight,ShipName,ShipAddress,ShipCity,ShipRegion,ShipPostalCode,ShipCountry
0,10540,QUICK,3,2013-05-19,2013-06-16,2013-06-13,3,1007.64,QUICK-Stop,Taucherstra√üe 10,Cunewalde,Western Europe,01307,Germany

In [35]:
# Answer
fifth_query = """
    SELECT 
        Shipper.CompanyName, Shipper.Phone
    FROM Shipper
    JOIN 'Order' 
        ON Shipper.Id = 'Order'.ShipVia
    WHERE 
        'Order'.Freight > 1000;
"""

pd.read_sql(q, conn)

,Id,CustomerId,EmployeeId,OrderDate,RequiredDate,ShippedDate,ShipVia,Freight,ShipName,ShipAddress,ShipCity,ShipRegion,ShipPostalCode,ShipCountry
0,10248,VINET,5,2012-07-04,2012-08-01,2012-07-16,3,32.38,Vins et alcools Chevalier,59 rue de l'Abbaye,Reims,Western Europe,51100,France

In [34]:
q = "SELECT * FROM 'Order' LIMIT 1;"
pd.read_sql(q, conn)

,Id,CustomerId,EmployeeId,OrderDate,RequiredDate,ShippedDate,ShipVia,Freight,ShipName,ShipAddress,ShipCity,ShipRegion,ShipPostalCode,ShipCountry
0,10248,VINET,5,2012-07-04,2012-08-01,2012-07-16,3,32.38,Vins et alcools Chevalier,59 rue de l'Abbaye,Reims,Western Europe,51100,France